#pragma once

#include "resource.h"

/*00. В диалогова кутия ABOUTBOX запишете трите си имена и факултетн номер.
01. В основния диалогов прозорец изпишете Контролна работа №1 и текущата дата на последователни редове използвайки текстови ресурси.
02. При натискане на десния бутон на мишката да се отвори контекстно меню POP.
03. При натискане на бутона от менюто Problem_1, ако е маркиран Problem_2 да се отвори диалогова кутия номер 1.
04. При натискане на бутон POP_1 да се отвори диалогова кутия номер 1.
05. При отваряне на диалоговата кутия в първите две тесктови кутии да се запишат съответно числата 1 и 9.
06. При натискане на бутна = да се извърши аритметична операция изваждане на целочислените стоиности от първите две тесктови кутии.
07. При натискане на бутона Calculate да се пресметне израза double d =
08. При натискане на бутон Problem_5 да се маркира или демаркира бутон Problem_2.
09. При натискане на бутон Problem_4 да се създаде нов елемент Problem_6
10. При натискане на Problem_6 да се изтрива.
11. При натискане на бутон POP_2 да се отваря кутия за съобщение която да изписва "Разрешаване на бутон Problem_5. С два бутона Yes и No и икона за внимание. При натискане на Yes да се появи кутия за съобщение в която е изписано "Бутон Problem_5 е разрешен" с бутон КО и икона за информация. При натискане на бутона No да се изпише "Бутон Problem_5 не може да се използва" с бутон Replay и Cancel и икона за грешка. При натискане на бутона Replay да се отваря отново пършата кутия за съобщения.
12. */